DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/stm32mp2/stm32mp2_pm.c
/*******************************************************************************
 * STM32MP2 handler called when a CPU is about to enter standby.
 ******************************************************************************/
static void stm32_cpu_standby(plat_local_state_t cpu_state)
{
	u_register_t scr = read_scr_el3();
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	assert(cpu_state == STM32MP_LOCAL_STATE_RET);

	stm32mp_state_set(core_id, STATE_RUNNING, false);

	/* Enable the Non-secure interrupt to wake the CPU. */
	write_scr_el3(scr | SCR_IRQ_BIT | SCR_FIQ_BIT);
	isb();
	/*
	 * Enter standby state.
	 * dsb is good practice before using wfi to enter low power states.
	 */
	dsb();
	wfi();

	write_scr_el3(scr);

	/* Coordinate the cores to prevent DDR access in self refresh */
	stm32mp_state_set(core_id, STATE_RUNNING, true);

	/* Force wake-up of other core, waiting in WFI */
	plat_ic_set_interrupt_pending(RCC_WAKEUP_IRQn);

	/* Handshake to wait DDR */
	while (!stm32mp_state_check(STM32MP_PRIMARY_CPU, STATE_DDR)) {
		wfe();
	}

	/* DDR is available, the other core is running */
	plat_ic_clear_interrupt_pending(RCC_WAKEUP_IRQn);
}

/*******************************************************************************
 * STM32MP2 handler called when a power domain is about to be turned on. The
 * mpidr determines the CPU to be turned on.
 * Called by core 0 to activate core 1.
 ******************************************************************************/
static int stm32_pwr_domain_on(u_register_t mpidr)
{
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	if (stm32mp_is_single_core()) {
		return PSCI_E_NOT_SUPPORTED;
	}

	stm32mp_state_set(core_id, STATE_START, true);

	if (core_id == STM32MP_PRIMARY_CPU) {
		/* Cortex-A35 core0 can't be turned OFF, emulate it with a WFE loop */
		VERBOSE("BL31: Releasing core0 from wait loop...\n");
		dsb();
		isb();
		sev();
	} else {
		/* Reset the secondary core */
		mmio_write_32(RCC_BASE + RCC_C1P1RSTCSETR, RCC_C1P1RSTCSETR_C1P1PORRST);
	}

	return PSCI_E_SUCCESS;
}

static void stm32_pwr_domain_off(const psci_power_state_t *target_state)
{
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	/* Prevent interrupts from spuriously waking up this cpu */
	stm32mp_gic_cpuif_disable();

	/* Force state to OFF to allow synchronization */
	stm32mp_state_set(core_id, STATE_START, false);
}

static void stm32mp2_setup_rcc_wakeup_irq(uintptr_t rcc_base)
{
	plat_ic_set_interrupt_type(RCC_WAKEUP_IRQn, INTR_TYPE_S_EL1);
	plat_ic_set_interrupt_priority(RCC_WAKEUP_IRQn, GIC_HIGHEST_SEC_PRIORITY);
}

static void stm32mp2_enable_rcc_wakeup_irq(uintptr_t rcc_base)
{
	plat_ic_set_spi_routing(RCC_WAKEUP_IRQn, INTR_ROUTING_MODE_ANY, 0x0U);
	/* Enable RCC Wake-up interrupt, */
	mmio_setbits_32(rcc_base + RCC_C1CIESETR, RCC_C1CIESETR_WKUPIE);
	plat_ic_enable_interrupt(RCC_WAKEUP_IRQn);
}

static void stm32mp2_disable_rcc_wakeup_irq(uintptr_t rcc_base)
{
	plat_ic_disable_interrupt(RCC_WAKEUP_IRQn);

	/* Clear wakeup flag */
	mmio_setbits_32(rcc_base + RCC_C1CIFCLRR, RCC_C1CIFCLRR_WKUPF);

	/* Disable RCC Wake-up interrupt */
	mmio_clrbits_32(rcc_base + RCC_C1CIESETR, RCC_C1CIESETR_WKUPIE);
}

/*
 * Core synchronization to protect DDR access for running cores
 * Handshake by using the state 'DDR' and 'RUNNING' to safely block
 * the exit of stm32_cpu_standby() for other core,
 * The 'DDR' flag is used only on STM32MP_PRIMARY_CPU core
 *  = true when DDR is accessble for any cores
 *  = false when 'core_id' try to set the DDR in self refresh mode
 * This function return true if other core is blocked in stm32_cpu_standby()
 */
static bool stm32_freeze_other_core(unsigned int core_id)
{
	bool result = true;
	unsigned int id;

	/* Forbid access on DDR in stm32_cpu_standby() */
	stm32mp_state_set(STM32MP_PRIMARY_CPU, STATE_DDR, false);

	/*
	 * Check if the other core is not started or running:
	 * no more in WFI loop in stm32_cpu_standby() after interuption
	 */
	for (id = 0U; id < PLATFORM_CORE_COUNT; id++) {
		if (id == core_id) {
			continue;
		}
		if (stm32mp_state_check(id, STATE_START) &&
		    stm32mp_state_check(id, STATE_RUNNING)) {
			result = false;
			break;
		}
	}
	if (!result) {
		/* Unblock the other core in stm32_cpu_standby() on error */
		stm32mp_state_set(STM32MP_PRIMARY_CPU, STATE_DDR, true);
		sev();
	}

	return result;
}

static int stm32_pwr_domain_validate_suspend(const psci_power_state_t *target_state)
{
	uintptr_t pwr_base = stm32mp_pwr_base();
	uint32_t stateid = stm32_get_stateid(target_state->pwr_domain_state);
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	/* If retention only at D1 level return as nothing is to be done */
	if (stateid == PWRSTATE_RUN) {
		return PSCI_E_SUCCESS;
	}

	/* If CPU2 is not in reset: low power mode is not supported by CPU1 */
	if ((mmio_read_32(pwr_base + PWR_CPU2D2SR) & PWR_CPU2D2SR_CSTATE_MASK) != 0U) {
		WARN("PSCI power domain supend request with Cortex M33 running.\n");
		return PSCI_E_INVALID_PARAMS;
	}

	if (!stm32_freeze_other_core(core_id)) {
		return PSCI_E_DENIED;
	}

	return PSCI_E_SUCCESS;
}

/* Display Stop2 or Standby1 modes, when console is available */
static void print_mode_info(const char *mode)
{
	INFO("Entering %s low power mode\n", mode);
}

/* Display Stop1 modes, at verbose level to avoid this trace with CPUIdle */
static void print_mode_verbose(const char *mode)
{
	VERBOSE("Entering %s low power mode\n", mode);
}

static void stm32_pwr_domain_suspend(const psci_power_state_t *target_state)
{
	uintptr_t pwr_base = stm32mp_pwr_base();
	uintptr_t rcc_base = stm32mp_rcc_base();
	bool standby = false;
	uint32_t stateid = stm32_get_stateid(target_state->pwr_domain_state);

	/* If retention only at D1 level return as nothing is to be done */
	if (stateid == PWRSTATE_RUN) {
		return;
	}

	/* Request STOP for both cores */
	mmio_write_32(rcc_base + RCC_C1SREQSETR, RCC_C1SREQSETR_STPREQ_MASK);

