DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/stm32mp2/stm32mp2_pm.c
	/*
	 * No PWR_LP delay by default, because VTT_DRR is not stopped (for Stop1)
	 * or VTT ramp-up delay is masked by VDD CPU delay (for other modes except LP-Stop1).
	 * It is required only for LP-Stop1 mode for design with STPMIC25.
	 */
	mmio_write_32(rcc_base + RCC_PWRLPDLYCR, 0U);

	/* Switch to Software Self-Refresh mode */
	if (stateid == PWRSTATE_STANDBY) {
		standby = true;
	}

	dcsw_op_all(DCCISW);
	ddr_save_sr_mode();
	ddr_set_sr_mode(DDR_SSR_MODE);
	if (ddr_sr_entry(standby) != 0) {
		panic();
	}

	/* Disable DDRSHR to avoid STANDBY/STOP exit issue */
	mmio_clrbits_32(rcc_base + RCC_DDRITFCFGR, RCC_DDRITFCFGR_DDRSHR);

	/* Perform the PWR configuration for the requested mode */
	switch (stateid) {
	case PWRSTATE_STOP1:
		print_mode_verbose("Stop1");
		mmio_write_32(pwr_base + PWR_CPU1CR, 0U);
		mmio_write_32(pwr_base + PWR_CPU2CR, 0U);
		stm32mp2_enable_rcc_wakeup_irq(rcc_base);
		break;

	case PWRSTATE_LP_STOP1:
		print_mode_verbose("LP_Stop1");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_LPDS_D1);
		mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_LPDS_D2);
		/* Wait VTT ramp-up delay for LP-Stop1 */
		mmio_write_32(rcc_base + RCC_PWRLPDLYCR, lpstop1_pwrlpdly);
		stm32mp2_enable_rcc_wakeup_irq(rcc_base);
		break;

	case PWRSTATE_LPLV_STOP1:
		print_mode_verbose("LPLV_Stop1");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_LPDS_D1 | PWR_CPU1CR_LVDS_D1);
		mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_LPDS_D2 | PWR_CPU2CR_LVDS_D2);
		stm32mp2_enable_rcc_wakeup_irq(rcc_base);
		break;

	case PWRSTATE_STOP2:
		print_mode_info("Stop2");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_PDDS_D1);
		mmio_write_32(pwr_base + PWR_CPU2CR, 0U);
		mmio_write_32(rcc_base + RCC_PWRLPDLYCR, stop2_pwrlpdly);
		stm32mp_gic_cpuif_disable();
		stm32mp_gic_save();
		stm32mp2_pll1_disable();
		break;

	case PWRSTATE_LP_STOP2:
		print_mode_info("LP_Stop2");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_PDDS_D1);
		mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_LPDS_D2);
		mmio_write_32(rcc_base + RCC_PWRLPDLYCR, stop2_pwrlpdly);
		stm32mp_gic_cpuif_disable();
		stm32mp_gic_save();
		stm32mp2_pll1_disable();
		break;

	case PWRSTATE_LPLV_STOP2:
		print_mode_info("LPLV_Stop2");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_PDDS_D1);
		mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_LPDS_D2 | PWR_CPU2CR_LVDS_D2);
		mmio_write_32(rcc_base + RCC_PWRLPDLYCR, stop2_pwrlpdly);
		stm32mp_gic_cpuif_disable();
		stm32mp_gic_save();
		stm32mp2_pll1_disable();
		break;

	case PWRSTATE_STANDBY:
		print_mode_info("Standby1");
		mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_PDDS_D1 | PWR_CPU1CR_PDDS_D2);
		mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_PDDS_D2);

		stm32mp_gic_cpuif_disable();
		stm32mp2_pll1_disable();
		break;

	default:
		panic();
		break;
	}

	/* Clear previous status */
	mmio_setbits_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_CSSF);
	mmio_setbits_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_CSSF);
	mmio_setbits_32(pwr_base + PWR_CPU3CR, PWR_CPU3CR_CSSF);

	/* Enable the Non-secure interrupt to wake up the CPU with WFI for pending interrupt */
	saved_scr_el3 = read_scr_el3();
	write_scr_el3(saved_scr_el3 | SCR_IRQ_BIT | SCR_FIQ_BIT);
}

/*******************************************************************************
 * STM32MP2 handler called when a power domain has just been powered on after
 * being turned off earlier. The target_state encodes the low power state that
 * each level has woken up from.
 * Called by core 1 just after wake up.
 ******************************************************************************/
static void stm32_pwr_domain_on_finish(const psci_power_state_t *target_state)
{
	uintptr_t rcc_base = stm32mp_rcc_base();
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	stm32mp_state_set(core_id, STATE_RUNNING, true);
	if (core_id == STM32MP_PRIMARY_CPU) {
		dsb();
		isb();
	} else {
		/* Restore generic timer after reset */
		stm32mp_stgen_restore_rate();
	}

	stm32mp2_disable_rcc_wakeup_irq(rcc_base);

	stm32mp_gic_pcpu_init();
	stm32mp_gic_cpuif_enable();

	mmio_write_32(rcc_base + RCC_C1SREQCLRR, RCC_C1SREQCLRR_STPREQ_MASK);
}

/*******************************************************************************
 * STM32MP2 handler called when a power domain has just been powered on after
 * having been suspended earlier. The target_state encodes the low power state
 * that each level has woken up from.
 ******************************************************************************/
static void stm32_pwr_domain_suspend_finish(const psci_power_state_t
					    *target_state)
{
	uintptr_t rcc_base = stm32mp_rcc_base();
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);
	uint32_t stateid = stm32_get_stateid(target_state->pwr_domain_state);

	stm32mp_state_set(core_id, STATE_RUNNING, true);

	stm32mp2_disable_rcc_wakeup_irq(rcc_base);

	mmio_write_32(rcc_base + RCC_C1SREQCLRR, RCC_C1SREQCLRR_STPREQ_MASK);

	/* Restore DDRSHR after STANDBY/STOP exit issue */
	mmio_setbits_32(rcc_base + RCC_DDRITFCFGR, RCC_DDRITFCFGR_DDRSHR);

	/* Perform the common system specific operations */
	switch (stateid) {
	case PWRSTATE_STANDBY:
		VERBOSE("STANDBY exit\n");
		/* Restore the DDR self refresh mode */
		ddr_restore_sr_mode();
		break;
	case PWRSTATE_STOP2:
	case PWRSTATE_LP_STOP2:
	case PWRSTATE_LPLV_STOP2:
		VERBOSE("STOP2 exit\n");
		/* Restore STGEN and generic timer with current clock */
		stm32mp_stgen_config(clk_get_rate(CK_KER_STGEN));

		/* Exit DDR self refresh mode after STOP mode */
		ddr_sr_exit();
		ddr_restore_sr_mode();

		stm32mp_gic_resume();
		stm32mp_gic_cpuif_enable();

		/* Restore register in CA35SS */
		mmio_write_32(A35SSC_BASE + CA35SS_SYSCFG_VBAR_CR, stm32_sec_entrypoint);

		/* Start the secondary core if it was running before STOP */
		if ((core_id == STM32MP_PRIMARY_CPU) &&
		    stm32mp_state_check(STM32MP_SECONDARY_CPU, STATE_START)) {
			/* Reset the secondary core to execute warm boot */
			mmio_write_32(RCC_BASE + RCC_C1P1RSTCSETR, RCC_C1P1RSTCSETR_C1P1PORRST);
		}
		break;
	case PWRSTATE_STOP1:
	case PWRSTATE_LP_STOP1:
	case PWRSTATE_LPLV_STOP1:
		VERBOSE("STOP1 exit\n");
		/* Exit DDR self refresh mode after STOP mode */
		ddr_sr_exit();
		ddr_restore_sr_mode();
		stm32mp2_disable_rcc_wakeup_irq(rcc_base);
		break;
	default:
		ERROR("Invalid state id %x\n", stateid);
		panic();
		break;
	}

