DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/stm32mp2/stm32mp2_pm.c
	/* Restore SCR */
	write_scr_el3(saved_scr_el3);

	/* Core synchronization to protect DDR access */
	stm32mp_state_set(STM32MP_PRIMARY_CPU, STATE_DDR, true);
	/* Unblock the other core in CPU standby loop */
	sev();
}

static void __dead2 stm32_pwr_domain_pwr_down_wfi(const psci_power_state_t
						  *target_state)
{
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);

	/* Core is no more running (stopped or suspended) */
	stm32mp_state_set(core_id, STATE_RUNNING, false);

	/* The first power down on core 0, core 1 is running */
	if ((core_id == STM32MP_PRIMARY_CPU) &&
	    !stm32mp_state_check(STM32MP_PRIMARY_CPU, STATE_START)) {
		uintptr_t sec_entrypoint;

		/* Core 0 can't be turned OFF, emulate it with a WFE loop */
		VERBOSE("BL31: core0 entering wait loop...\n");
		while (!stm32mp_state_check(STM32MP_PRIMARY_CPU, STATE_START)) {
			wfe();
		}

		VERBOSE("BL31: core0 resumed.\n");
		dsbsy();
		sec_entrypoint = mmio_read_32(A35SSC_BASE + CA35SS_SYSCFG_VBAR_CR);
		/* Jump manually to entry point, with mmu disabled. */
		disable_mmu_el3();
		((void(*)(void))sec_entrypoint)();

		/* This shouldn't be reached */
		panic();
	}

	if (psci_is_last_on_cpu_safe() &&
	    stm32_get_stateid(target_state->pwr_domain_state) == PWRSTATE_STANDBY) {
		/* Save the context when all the core are requested to stop */
		stm32_pm_context_save(target_state);
	}

	/*
	 * Synchronize on memory accesses and instruction flow before
	 * auto-reset from the WFI instruction.
	 */
	dsb();
	isb();
	wfi();

	/* This shouldn't be reached */
	panic();
}

static void __dead2 stm32_system_off(void)
{
	uintptr_t pwr_base = stm32mp_pwr_base();
	uintptr_t rcc_base = stm32mp_rcc_base();
	u_register_t mpidr = read_mpidr();
	unsigned int core_id = MPIDR_AFFLVL0_VAL(mpidr);
	uintptr_t exti2_base = STM32MP_EXTI2_BASE;
	uint32_t otp_idx = 0U;
	uint32_t otp_value = 0U;

	if (core_id != STM32MP_PRIMARY_CPU) {
		ERROR("PSCI system off request on core %u\n", core_id);
		panic();
	}

	if (!stm32_freeze_other_core(core_id)) {
		WARN("PSCI system off with other core running.\n");

		/* Core is no more running */
		stm32mp_state_set(STM32MP_SECONDARY_CPU, STATE_RUNNING, false);

		/* Program secondary CPU entry points */
		mmio_write_32(A35SSC_BASE + CA35SS_SYSCFG_VBAR_CR,
			      (uintptr_t)&stm32_stop2_entrypoint);

		/* After reset, the core is stopped, waiting in WFI loop */
		stm32mp_state_set(STM32MP_SECONDARY_CPU, STATE_START, false);

		/* Reset the secondary core */
		mmio_write_32(RCC_BASE + RCC_C1P1RSTCSETR, RCC_C1P1RSTCSETR_C1P1PORRST);

		/* Forbid access to DDR */
		stm32mp_state_set(STM32MP_PRIMARY_CPU, STATE_DDR, false);
	}

	/* If CPU2 is not in reset */
	if ((mmio_read_32(pwr_base + PWR_CPU2D2SR) & PWR_CPU2D2SR_CSTATE_MASK) != 0U) {
		WARN("PSCI system off with Cortex M33 running.\n");
		/* Force Hold Boot and reset of CPU2 = Cortex M33 */
		mmio_clrbits_32(rcc_base + RCC_CPUBOOTCR, RCC_CPUBOOTCR_BOOT_CPU2);
		mmio_setbits_32(rcc_base + RCC_C2RSTCSETR, RCC_C2RSTCSETR_C2RST);
	}

	/* If CPU3 is not in reset */
	if ((mmio_read_32(pwr_base + PWR_CPU3D3SR) & PWR_CPU3D3SR_CSTATE_MASK) != 0U) {
		WARN("PSCI system off with Cortex M0 running.\n");
		/* Force reset of CPU3 = Cortex M0+ */
		mmio_setbits_32(rcc_base + RCC_C3CFGR, RCC_C3CFGR_C3RST);
	}

	/* Freeze all watchdog with shadow value of HCONF1 */
	if (stm32_get_otp_index(HCONF1_OTP, &otp_idx, NULL) == 0U) {
		if (stm32_get_otp_value_from_idx(otp_idx, &otp_value) == 0U) {
			otp_value |= HCONF1_OTP_IWDG_FZ_STANDBY_MASK(0);
			otp_value |= HCONF1_OTP_IWDG_FZ_STANDBY_MASK(1);
			otp_value |= HCONF1_OTP_IWDG_FZ_STANDBY_MASK(2);
			otp_value |= HCONF1_OTP_IWDG_FZ_STANDBY_MASK(3);
			stm32_otp_write(otp_value, otp_idx);
		}
	}

	/* Force DDR off */
	ddr_sub_system_clk_off();

	/* Prevent interrupts from spuriously waking up this cpu */
	stm32mp_gic_cpuif_disable();

	/* Request STOP for both cores */
	mmio_write_32(rcc_base + RCC_C1SREQSETR, RCC_C1SREQSETR_STPREQ_MASK);

	/* Request standby2 */
	mmio_write_32(pwr_base + PWR_CPU1CR, PWR_CPU1CR_PDDS_D1 | PWR_CPU1CR_PDDS_D2);
	mmio_write_32(pwr_base + PWR_CPU2CR, PWR_CPU2CR_PDDS_D2);
	mmio_write_32(pwr_base + PWR_D3CR, PWR_D3CR_PDDS_D3);
	stm32mp2_pll1_disable();

	/* Do not maintain RETRAM memory content in Standby or Vbat */
	mmio_write_32(pwr_base + PWR_CR10, PWR_CR10_RETRBSEN_DISABLE);

	/* Clear PM context in BKPSRAM: cold boot at next wake-up */
	stm32_pm_context_clear();

	/* Deactivate all WakeUp except WKUP pins */
	mmio_write_32(exti2_base + EXTI2_C1IMR1, 0U);
	mmio_write_32(exti2_base + EXTI2_C1IMR2, 0U);
	mmio_write_32(exti2_base + EXTI2_C1IMR3, 0U);
	mmio_write_32(exti2_base + EXTI2_C2IMR1, 0U);
	mmio_write_32(exti2_base + EXTI2_C2IMR2, 0U);
	mmio_write_32(exti2_base + EXTI2_C2IMR3, 0U);
	mmio_write_32(exti2_base + EXTI2_C3IMR1, 0U);
	mmio_write_32(exti2_base + EXTI2_C3IMR2, 0U);
	mmio_write_32(exti2_base + EXTI2_C3IMR3, 0U);

	/* Disable STATE_RUNNING state for this core */
	stm32mp_state_set(core_id, STATE_RUNNING, false);

	VERBOSE("BL31: power off\n");

	dsb();
	isb();
	wfi();

	/* This shouldn't be reached */
	panic();
}

static void __dead2 stm32_system_reset(void)
{
	stm32mp_system_reset();
}

/**
 * stm32_validate_power_state() - This function ensures that the power state
 * parameter in request is valid.
 *
 * @power_state		Power state of core
 * @req_state		Requested state
 *
 * @return	Returns status, either success or reason
 */
static int stm32_validate_power_state(unsigned int power_state,
				      psci_power_state_t *req_state)
{
	unsigned int state_id;
	unsigned int i;

	assert(req_state != NULL);

	/*
	 *  Currently we are using a linear search for finding the matching
	 *  entry in the idle power state array. This can be made a binary
	 *  search if the number of entries justify the additional complexity.
	 */
	for (i = 0U; stm32mp_pm_idle_states[i] != 0U; i++) {
		if (power_state == stm32mp_pm_idle_states[i]) {
			break;
		}
	}

	/* Return error if entry not found in the idle state array */
	if (stm32mp_pm_idle_states[i] == 0U) {
		return PSCI_E_INVALID_PARAMS;
	}

	/* Search if board restrict the number of supported modes */
	for (i = 0U; stm32mp_supported_pwr_states[i] != 0U; i++) {
		if (power_state == stm32mp_supported_pwr_states[i]) {
			break;
		}
	}
	if (stm32mp_supported_pwr_states[i] == 0U) {
		ERROR("PSCI power state not supported %x\n", power_state);
		return PSCI_E_INVALID_PARAMS;
	}

	i = 0U;
	state_id = psci_get_pstate_id(power_state);

	/* Parse the State ID and populate the state info parameter */
	while (state_id != 0U) {
		req_state->pwr_domain_state[i++] = state_id & PLAT_LOCAL_PSTATE_MASK;
		state_id >>= PLAT_LOCAL_PSTATE_WIDTH;
	}

