DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/stm32mp2/stm32mp2_pm.c
	/*
	 * With PSCI v1.0 Extended State-ID, 'last at pwrlvl' is not directly available
	 * and with current toplogy only the CPU level is checked for coordination
	 */
	req_state->last_at_pwrlvl = LVL_CORE;

	return PSCI_E_SUCCESS;
}

static int stm32_validate_ns_entrypoint(uintptr_t entrypoint)
{
	/* The non-secure entry point must be in DDR */
	if (entrypoint < STM32MP_DDR_BASE) {
		return PSCI_E_INVALID_ADDRESS;
	}

	return PSCI_E_SUCCESS;
}

/*
 * The PSCI code uses this API to let the platform participate in state
 * coordination during a power management operation. It compares the platform
 * specific local power states requested by each cpu for a given power domain
 * and returns the coordinated target power state that the domain should
 * enter.
 * This implementation assumes that the power state is RUN for simple
 * CPU STANDBY called by fast path in psci_cpu_suspend(), and assumes that the
 * power state are ordered in increasing depth of the power.
 * As a result, the  coordinated target local power state for a power domain
 * will be the minimum of the requested local power states wich is NOT RUN.
 * And it return a invalid state ()= OFF_STATE + 1) when state is RUN for all
 * the cpu.
 */
plat_local_state_t plat_get_target_pwr_state(unsigned int lvl,
					     const plat_local_state_t *states,
					     unsigned int ncpu)
{
	plat_local_state_t target = PLAT_MAX_OFF_STATE + 1U, temp;
	const plat_local_state_t *st = states;
	unsigned int n = ncpu;

	assert(ncpu > 0U);

	do {
		temp = *st;
		st++;
		if ((temp < target) && (temp != STM32MP_LOCAL_STATE_RUN)) {
			target = temp;
		}
		n--;
	} while (n > 0U);

	return target;
}

/**
 * stm32_get_sys_suspend_power_state() -  Get power state for system suspend
 *
 * @req_state	Requested state
 */
static void stm32_get_sys_suspend_power_state(psci_power_state_t *req_state)
{
	unsigned int state_id;
	unsigned int pwr_state, max_pwr_state = PWRSTATE_STANDBY;
	unsigned int i;
	uintptr_t exti_base = STM32MP_EXTI1_BASE;
	uint32_t c1imr1 = mmio_read_32(exti_base + EXTI1_C1IMR1);
	uint32_t c1imr2 = mmio_read_32(exti_base + EXTI1_C1IMR2);
	uint32_t c1imr3 = mmio_read_32(exti_base + EXTI1_C1IMR3);

	/* Verify the max level supported according to the activated EXTI1 */
	if ((c1imr1 & (EXTI1_C1IMR1_PVD | EXTI1_C1IMR1_PVM)) != 0U) {
		max_pwr_state = PWRSTATE_LPLV_STOP2;
		VERBOSE("%s: max_pwr_state = PWRSTATE_LPLV_STOP2 C1IMR1=%x\n", __func__, c1imr1);
	}

	/* Wake-up pin are connected directly to PWR */
	if (((c1imr1 & ~(EXTI1_C1IMR1_PVD | EXTI1_C1IMR1_PVM)) != 0U) ||
	    ((c1imr2 & ~EXTI1_C1IMR2_WKUP_MASK) != 0U) || (c1imr3 != 0U)) {
		max_pwr_state = PWRSTATE_LP_STOP2;
		VERBOSE("%s: max_pwr_state = PWRSTATE_LP_STOP2, C1IMR1=%x, C1IMR2=%x, C1IMR3=%x\n",
			__func__, c1imr1, c1imr2, c1imr3);
	}

	/* Search the max supported POWERDOWN modes  <= max_pwr_state */
	for (i = ARRAY_SIZE(stm32mp_supported_pwr_states) - 1U; i > 0U; i--) {
		pwr_state = stm32mp_supported_pwr_states[i];
		if ((pwr_state != 0U) && (pwr_state <= max_pwr_state) &&
		    (psci_get_pstate_type(pwr_state) == PSTATE_TYPE_POWERDOWN)) {
			break;
		}
	}
	state_id = psci_get_pstate_id(pwr_state);

	/* Parse the State ID and populate the state info parameter */
	for (i = 0U; i <= PLAT_MAX_PWR_LVL; i++) {
		req_state->pwr_domain_state[i] = state_id & PLAT_LOCAL_PSTATE_MASK;
		state_id >>= PLAT_LOCAL_PSTATE_WIDTH;
	}

	/*
	 * With PSCI v1.0 Extended State-ID, 'last at pwrlvl' is not directly available
	 * and with current toplogy only the CPU level is checked for coordination
	 */
	req_state->last_at_pwrlvl = LVL_CORE;
}

/*******************************************************************************
 * Export the platform handlers. The ARM Standard platform layer will take care
 * of registering the handlers with PSCI.
 ******************************************************************************/
static const plat_psci_ops_t stm32_psci_ops = {
	.cpu_standby = stm32_cpu_standby,
	.pwr_domain_on = stm32_pwr_domain_on,
	.pwr_domain_off = stm32_pwr_domain_off,
	.pwr_domain_validate_suspend = stm32_pwr_domain_validate_suspend,
	.pwr_domain_suspend = stm32_pwr_domain_suspend,
	.pwr_domain_on_finish = stm32_pwr_domain_on_finish,
	.pwr_domain_suspend_finish = stm32_pwr_domain_suspend_finish,
	.pwr_domain_pwr_down_wfi = stm32_pwr_domain_pwr_down_wfi,
	.system_off = stm32_system_off,
	.system_reset = stm32_system_reset,
	.validate_power_state = stm32_validate_power_state,
	.validate_ns_entrypoint = stm32_validate_ns_entrypoint,
	.get_sys_suspend_power_state = stm32_get_sys_suspend_power_state,
};

/*******************************************************************************
 * This function retrieve the generic information from DT.
 * Returns node on success and a negative FDT error code on failure.
 ******************************************************************************/
static int stm32_parse_domain_idle_state(void *fdt)
{
	unsigned int domain_idle_states[PM_IDLE_STATES_SIZE];
	int node = 0;
	int subnode = 0;
	uint32_t power_state;
	unsigned int i = 0U;
	unsigned int j = 0U;
	unsigned int nb_states = 0U;
	int ret;

	/* Search supported domain-idle-state in device tree */
	node = fdt_path_offset(fdt, "/cpus/domain-idle-states");
	if (node < 0) {
		return node;
	}

	memset(domain_idle_states, 0, sizeof(domain_idle_states));
	fdt_for_each_subnode(subnode, fdt, node) {
		ret = fdt_read_uint32(fdt, subnode, "arm,psci-suspend-param", &power_state);
		if (ret != 0) {
			return ret;
		}

		/* Cross check with supported pm idle state in driver */
		for (j = 0U; stm32mp_pm_idle_states[j] != 0U; j++) {
			if (stm32mp_pm_idle_states[j] == power_state) {
				break;
			}
		}
		/* Return error if entry not found and not standby */
		if ((stm32mp_pm_idle_states[j] == 0U) && (power_state != PWRSTATE_STANDBY)) {
			return -EINVAL;
		}

		domain_idle_states[i++] = power_state;

		/* Check array size */
		if (i > ARRAY_SIZE(domain_idle_states)) {
			return -E2BIG;
		}
	}

	memset(stm32mp_supported_pwr_states, 0, sizeof(stm32mp_supported_pwr_states));

	/* The CPU idle state is always supported, not present in domain node */
	stm32mp_supported_pwr_states[nb_states++] = PWRSTATE_RUN;

