DanielMartensson/STM32-Computer/STM32CubeIDE/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/stm32mp2/stm32mp2_pm.c
	/* Add each supported power state with same order than stm32mp_pm_idle_states */
	for (j = 0U; stm32mp_pm_idle_states[j] != 0U; j++) {
		for (i = 0U; domain_idle_states[i] != 0U && i < PM_IDLE_STATES_SIZE; i++) {
			if (domain_idle_states[i] == stm32mp_pm_idle_states[j]) {
				stm32mp_supported_pwr_states[nb_states++] = domain_idle_states[i];
				break;
			}
		}
	}

	/* Add STANDBY at the end of the list if supported */
	for (i = 0U; domain_idle_states[i] != 0U && i < PM_IDLE_STATES_SIZE; i++) {
		if (domain_idle_states[i] == PWRSTATE_STANDBY) {
			stm32mp_supported_pwr_states[nb_states++] = PWRSTATE_STANDBY;
			break;
		}
	}

	VERBOSE("stm32mp_supported_pwr_states[]=\n");
	for (i = 0U; stm32mp_supported_pwr_states[i] != 0U; i++) {
		VERBOSE("%u = %x\n", i, stm32mp_supported_pwr_states[i]);
	}

	return 0;
}

/*******************************************************************************
 * Initialize STM32MP2 for PM support: RCC, PWR
 ******************************************************************************/
struct pm_param {
	uint8_t popl_d1;
	uint8_t podh_d2;
	uint8_t popl_d2;
	uint8_t lplvdly_d2;
	uint8_t lpcfg_d2;
	uint32_t lpstop1dly;
};

static void stm32_read_dt_pm_param(void *fdt, struct pm_param *param)
{
	int node;

	node = fdt_node_offset_by_compatible(fdt, -1, DT_PWR_COMPAT);
	if (node <= 0) {
		panic();
	}

	param->popl_d1 = fdt_read_uint32_default(fdt, node, "st,popl-d1-ms", DEFAULT_POPL_D1);
	param->podh_d2 = fdt_read_uint32_default(fdt, node, "st,podh-d2-ms", DEFAULT_PODH_D2);
	param->popl_d2 = fdt_read_uint32_default(fdt, node, "st,popl-d2-ms", DEFAULT_POPL_D2);
	param->lpcfg_d2 = fdt_read_uint32_default(fdt, node, "st,lpcfg-d2", DEFAULT_LPCFG_D2);
	param->lplvdly_d2 = fdt_read_uint32_default(fdt, node, "st,lplvdly-d2", DEFAULT_LPLVDLY_D2);
	param->lpstop1dly = fdt_read_uint32_default(fdt, node, "st,lpstop1dly-us",
						    DEFAULT_LPSTOP1DLY);
}

static void stm32_pm_init(void *fdt)
{
	uintptr_t pwr_base = stm32mp_pwr_base();
	uintptr_t rcc_base = stm32mp_rcc_base();
	uint32_t lsmcu;
	struct pm_param param;

	stm32mp2_setup_rcc_wakeup_irq(rcc_base);

	/* RCC init: DDR is shared by default */
	mmio_setbits_32(rcc_base + RCC_DDRITFCFGR, RCC_DDRITFCFGR_DDRSHR);

	/* Legacy mode: only CPU1 is allowed to boot, core1 is OFF */
	mmio_setbits_32(rcc_base + RCC_LEGBOOTCR, RCC_LEGBOOTCR_LEGACY_BEN);

	mmio_write_32(rcc_base + RCC_C1SREQCLRR, RCC_C1SREQSETR_STPREQ_MASK);

	/* Maintain BKPSRAM & RETRAM content in Standby */
	mmio_write_32(pwr_base + PWR_CR9, PWR_CR9_BKPRBSEN);
	mmio_write_32(pwr_base + PWR_CR10, PWR_CR10_RETRBSEN_STANDBY);

	/* Prevent RETRAM erase */
	mmio_write_32(RAMCFG_BASE + RAMCFG_RETRAMCR, SRAMHWERDIS);

	/* System standby not set (D3) */
	mmio_write_32(pwr_base + PWR_D3CR, 0U);

	/* Configure delay in PWR */
	stm32_read_dt_pm_param(fdt, &param);

	mmio_write_32(pwr_base + PWR_D1CR,
		      (param.popl_d1 << PWR_D1CR_POPL_D1_SHIFT) & PWR_D1CR_POPL_D1_MASK);

	mmio_write_32(pwr_base + PWR_D2CR,
		      (param.lpcfg_d2 & PWR_D2CR_LPCFG_D2) |
		      ((param.popl_d2  << PWR_D2CR_POPL_D2_SHIFT) & PWR_D2CR_POPL_D2_MASK) |
		      ((param.lplvdly_d2 << PWR_D2CR_LPLVDLY_D2_SHIFT) & PWR_D2CR_LPLVDLY_D2_MASK) |
		      ((param.podh_d2 << PWR_D2CR_PODH_D2_SHIFT) & PWR_D2CR_PODH_D2_MASK));

	/* Compute RCC PWR LP DLY according to parent clock */
	lsmcu = mmio_read_32(rcc_base + RCC_LSMCUDIVR) & RCC_LSMCUDIVR_LSMCUDIV;
	lpstop1_pwrlpdly = PWRLPDLYCR_VAL(param.lpstop1dly, lsmcu);
	/* Wait 2ms for Stop2 */
	stop2_pwrlpdly = PWRLPDLYCR_VAL(2000, lsmcu);
}

/*******************************************************************************
 * Export the platform specific power ops.
 ******************************************************************************/
int plat_setup_psci_ops(uintptr_t sec_entrypoint,
			const plat_psci_ops_t **psci_ops)
{
	int ret = 0;
	void *fdt = NULL;
	uint32_t stop2_entrypoint = (uint32_t)(uintptr_t)&stm32_stop2_entrypoint;
	struct nvmem_cell stop2_entrypoint_cell;
	assert(stop2_entrypoint < UINT32_MAX);

	if (fdt_get_address(&fdt) == 0) {
		panic();
	}

	ret = stm32_parse_domain_idle_state(fdt);
	if (ret != 0) {
		ERROR("invalid domain-idle-states in device tree %d\n", ret);
		panic();
	}

	/* Program secondary CPU entry points. */
	stm32_sec_entrypoint = sec_entrypoint;
	mmio_write_32(A35SSC_BASE + CA35SS_SYSCFG_VBAR_CR, stm32_sec_entrypoint);

	/* Initialize the state per cpu */
	stm32_percpu_data[STM32MP_PRIMARY_CPU].state[STATE_START] = true;
	stm32_percpu_data[STM32MP_PRIMARY_CPU].state[STATE_RUNNING] = true;
	stm32_percpu_data[STM32MP_PRIMARY_CPU].state[STATE_DDR] = true;
	stm32_percpu_data[STM32MP_SECONDARY_CPU].state[STATE_START] = false;
	stm32_percpu_data[STM32MP_SECONDARY_CPU].state[STATE_RUNNING] = false;

	/* Save boot entry point for STOP2 exit */
	ret = stm32_get_stop2_entrypoint_cell(&stop2_entrypoint_cell);
	if (ret != 0) {
		return ret;
	}
	nvmem_cell_write(&stop2_entrypoint_cell, (uint8_t *)&stop2_entrypoint,
			 sizeof(stop2_entrypoint));

	stm32_pm_init(fdt);

	*psci_ops = &stm32_psci_ops;

	return 0;
}
